{
  "chart": {
    "idx_to_token": [
      "NP-PN|<>",
      "NP-PN",
      "NP-SBJ",
      "IP-HLN",
      "NP|<>",
      "NP",
      "VP",
      "FRAG|<>",
      "FRAG",
      "NP-PN-SBJ|<>",
      "NP-PN-SBJ",
      "IP|<>",
      "IP",
      "LCP-TMP",
      "VP|<>",
      "LCP-TMP|<>",
      "VCD|<>",
      "VCD",
      "IP+VP",
      "CP+CP",
      "NP-OBJ|<>",
      "NP-OBJ",
      "NP-APP|<>",
      "NP-APP",
      "CP|<>",
      "QP|<>",
      "QP",
      "CLP",
      "DNP",
      "DNP|<>",
      "ADJP",
      "NP-PRD|<>",
      "NP-PRD",
      "NP-OBJ-PN",
      "ADVP",
      "NP-SBJ+CP+CP",
      "NP-TMP",
      "PP|<>",
      "PP",
      "DVP",
      "DVP|<>",
      "CP-APP",
      "NP-EXT",
      "LCP",
      "LCP|<>",
      "VP+VP",
      "CP-APP|<>",
      "NP-APP-PN|<>",
      "NP-APP-PN",
      "ADVP|<>",
      "NP-OBJ-1|<>",
      "NP-OBJ-1",
      "DP",
      "NP-SBJ|<>",
      "NP-LOC",
      "IP-SBJ+VP",
      "IP-ADV",
      "QP-EXT|<>",
      "QP-EXT",
      "DP-TMP|<>",
      "DP-TMP",
      "IP-OBJ",
      "PP-LOC|<>",
      "PP-LOC",
      "DP|<>",
      "PP-PRP|<>",
      "PP-PRP",
      "IP-ADV+VP",
      "NP-ADV",
      "CP+IP+VP",
      "CP-ADV",
      "NP-TPC",
      "IP-OBJ+VP",
      "IP-TPC+VP",
      "IP-OBJ+IP",
      "NP-TMP|<>",
      "IP-OBJ|<>",
      "PRN|<>",
      "PRN",
      "QP-OBJ|<>",
      "QP-OBJ",
      "PP-DIR|<>",
      "PP-DIR",
      "VRD|<>",
      "VRD",
      "PP-TMP|<>",
      "PP-TMP",
      "LCP-LOC",
      "LCP-LOC|<>",
      "LCP-OBJ",
      "LCP-OBJ|<>",
      "QP-PRD|<>",
      "QP-PRD",
      "NP-TPC|<>",
      "IP-HLN|<>",
      "PP-ADV|<>",
      "PP-ADV",
      "IP-SBJ",
      "UCP",
      "LCP-SBJ",
      "LCP-SBJ|<>",
      "QP-SBJ|<>",
      "QP-SBJ",
      "VP+VCD",
      "PP-LGS|<>",
      "PP-LGS",
      "NP-TTL|<>",
      "NP-TTL",
      "CP+IP",
      "VP-PRP|<>",
      "VP-PRP",
      "QP-ADV|<>",
      "QP-ADV",
      "IP-APP+VP",
      "PP-BNF|<>",
      "PP-BNF",
      "QP-TMP",
      "CP-APP+IP",
      "NP-PRD+CP+CP",
      "PP+PP",
      "PP-MNR|<>",
      "PP-MNR",
      "CP",
      "NP-OBJ-PN|<>",
      "NP-LOC-PN",
      "NP-PN-TPC|<>",
      "NP-PN-TPC",
      "ADJP|<>",
      "VP+QP-PRD",
      "VSB|<>",
      "VSB",
      "CLP-2",
      "QP-SBJ-1|<>",
      "QP-SBJ-1",
      "VP+VRD",
      "VP+VSB",
      "PP-PRD|<>",
      "VP+PP-PRD",
      "DP-ADV|<>",
      "DP-ADV",
      "DP-TPC",
      "UCP-APP|<>",
      "UCP-APP",
      "NP-SBJ-1",
      "LST",
      "IP-PRD",
      "IP-PRD|<>",
      "IP-SBJ|<>",
      "IP+VP+VSB",
      "UCP-PRD|<>",
      "UCP-PRD",
      "IP+VP+VP",
      "IP-CND+VP",
      "CLP|<>",
      "NP-PN-PRD|<>",
      "NP-PN-PRD",
      "VP-FOC|<>",
      "VP-FOC",
      "VP+NP-PRD",
      "IP+IP",
      "QP-3|<>",
      "QP-3",
      "CLP-4",
      "UCP|<>",
      "CLP-3",
      "CLP-1",
      "LCP-ADV",
      "LCP-ADV|<>",
      "NP-OBJ=2|<>",
      "NP-OBJ=2",
      "QP-EXT=3|<>",
      "QP-EXT=3",
      "LCP-EXT",
      "LCP-EXT|<>",
      "PP-PRD",
      "DNP-PRD",
      "DNP-PRD|<>",
      "UCP-SBJ|<>",
      "UCP-SBJ",
      "IP-APP",
      "NP-OBJ=8",
      "QP-EXT=9|<>",
      "QP-EXT=9",
      "IP-APP|<>",
      "IP+VP+VCD",
      "CP+IP+VP+VCD",
      "IP+VP+VP+VCD",
      "VNV|<>",
      "VNV",
      "NP-IO",
      "QP-PN|<>",
      "QP-PN",
      "NP-PRD+NP",
      "NP-LOC|<>",
      "VP+NP-PRD+CP+CP",
      "VP+VP+NP-PRD",
      "IP-LOC+VP",
      "PP-SBJ",
      "NP-PN-TTL|<>",
      "NP-PN-TTL",
      "NP-HLN",
      "IP-APP-TTL|<>",
      "IP-APP-TTL",
      "QP-EXT-2|<>",
      "QP-EXT-2",
      "NP-HLN|<>",
      "VPT|<>",
      "VPT",
      "NP+NP",
      "VCP|<>",
      "VCP",
      "PP+ADVP",
      "NP-OBJ-5|<>",
      "NP-OBJ-5",
      "NP-OBJ-TTL|<>",
      "NP-OBJ-TTL",
      "NP-OBJ=8|<>",
      "CP+CP+CP",
      "DP-SBJ|<>",
      "DP-SBJ",
      "NP+CP+CP",
      "IP-ADV|<>",
      "VP+LCP-PRD",
      "LCP-PRD|<>",
      "CP-CND",
      "IP-2+VP",
      "NP-IO|<>",
      "IP-PRD+VP",
      "NP-OBJ-2|<>",
      "NP-OBJ-2",
      "NP-OBJ-3",
      "PP-MNR+NP",
      "PP-LGS+NP-PN",
      "PP-LGS+NP",
      "DP-OBJ|<>",
      "DP-OBJ",
      "LCP-PRD",
      "PRN-HLN|<>",
      "PRN-HLN",
      "IP-TPC",
      "IP-TMP+VP",
      "NP-OBJ-6",
      "NP-TPC-5+CP+CP",
      "NP-LOC-PN|<>",
      "CP-APP+CP",
      "IP-PRD-TTL|<>",
      "IP-PRD-TTL",
      "VP-PRD|<>",
      "VP-PRD",
      "DP-OBJ+DP",
      "IP-Q|<>",
      "IP-Q",
      "ADVP-WH",
      "CP+IP+VP+VP",
      "VP+QP-EXT",
      "DP-PRD|<>",
      "VP+DP-PRD",
      "NP-IO-PN",
      "NP-SBJ+CP+IP+VP",
      "NP-PRD+CP+IP",
      "VP-EXT",
      "CP-CND|<>",
      "IP+VP+NP-PRD",
      "UCP-OBJ|<>",
      "UCP-OBJ",
      "NP-PN-SBJ-TTL|<>",
      "NP-PN-SBJ-TTL",
      "IP-CND",
      "NP-ADV|<>",
      "NP-SBJ-TTL|<>",
      "NP-SBJ-TTL",
      "QP+CLP",
      "IP-OBJ+VP+VP",
      "VP+QP",
      "VP+NP-OBJ",
      "VP+QP-OBJ",
      "FRAG-OBJ|<>",
      "FRAG-OBJ",
      "DVP+VP",
      "QP-PRP|<>",
      "QP-PRP",
      "PP-EXT|<>",
      "PP-EXT",
      "PP-TTL|<>",
      "PP-TTL",
      "NP-SBJ-3",
      "NP-SBJ-4",
      "NP-OBJ-3|<>",
      "QP-TMP|<>",
      "IP+VP-WH",
      "VP-WH",
      "QP-OBJ+QP",
      "IP-OBJ+IP+VP",
      "NP-HLN-PN",
      "NP-OBJ+NP",
      "CP-Q|<>",
      "CP-Q",
      "IP-TTL|<>",
      "IP-TTL",
      "NP-OBJ-4",
      "IP-HLN+VP",
      "NP-HLN-PN+NP-PN",
      "IP-TMP",
      "VP+VPT",
      "NP-TPC-3|<>",
      "NP-TPC-3",
      "IP-SBJ+VP+VRD",
      "PP-APP-TTL|<>",
      "PP-APP-TTL",
      "NP-MNR|<>",
      "NP-MNR",
      "NP-IJ",
      "IP-OBJ-Q+VP",
      "CP-ADV|<>",
      "NP-IJ-PN",
      "IP-OBJ-Q|<>",
      "IP-OBJ-Q",
      "CP-IJ",
      "CP-IJ|<>",
      "IP+VP+VRD",
      "NP-TPC-2|<>",
      "NP-TPC-2",
      "DNP-APP",
      "DNP-APP|<>",
      "NP-PRD+CP",
      "CP-OBJ+IP",
      "IP-TPC-1|<>",
      "IP-TPC-1",
      "IP-OBJ+VP+VRD",
      "NP-APP+NP",
      "LCP-PRP",
      "LCP-PRP|<>",
      "NP-SBJ-2|<>",
      "NP-SBJ-2",
      "UCP-ADV|<>",
      "UCP-ADV",
      "PRN+NP",
      "NP-OBJ-4|<>",
      "NP-OBJ+QP",
      "NP-TPC-1|<>",
      "NP-TPC-1",
      "IP-TPC|<>",
      "NP-IO-PN|<>",
      "NP-OBJ+CP+CP",
      "NP-OBJ-6|<>",
      "NP-OBJ-SBJ|<>",
      "NP-OBJ-SBJ",
      "VP-PRP+VCD",
      "NP-SBJ+NP",
      "NP-PN+NP-PN",
      "FRAG+NP",
      "NP-APP-TTL|<>",
      "NP-APP-TTL",
      "IP-OBJ-2",
      "CP-APP+IP+VP",
      "NP-TPC-TTL|<>",
      "NP-TPC-TTL",
      "IP-IMP-PRD-TTL|<>",
      "IP-IMP-PRD-TTL",
      "DP-TMP+DP",
      "NP-SBJ-1|<>",
      "PP-LGS=1|<>",
      "PP-LGS=1",
      "PP-LGS=1+NP",
      "VP-3",
      "CLP-ADV",
      "NP-HLN-PN|<>",
      "PP-LOC+PP",
      "UCP-TMP|<>",
      "UCP-TMP",
      "CP-PRD",
      "CP-PRD|<>",
      "NP-OBJ=1",
      "QP-EXT=2|<>",
      "QP-EXT=2",
      "NP+DNP",
      "VP-PRP+VNV",
      "NP-OBJ=1|<>",
      "VP+NP-OBJ=1",
      "NP+NP-PN",
      "NP-1|<>",
      "NP-1",
      "ADVP-TMP",
      "PP-OBJ-TTL|<>",
      "PP-OBJ-TTL",
      "CP-PRP",
      "VP+ADVP",
      "IP-OBJ+VP-1",
      "IP-ADV+VP+VRD",
      "ADVP+NP",
      "NP-PN-TPC-1",
      "QP-ADV+QP",
      "PRN+VP",
      "NP=1|<>",
      "NP=1",
      "PP-TMP+NP=1",
      "IP-IMP+VP",
      "NP-VOC|<>",
      "NP-VOC",
      "NP-OBJ-PN-1",
      "NP-PRD=3|<>",
      "NP-PRD=3",
      "IP+VP+NP-OBJ-TTL",
      "NP-TPC-TTL-1|<>",
      "NP-TPC-TTL-1",
      "DP-APP|<>",
      "DP-APP",
      "NP-PN=66|<>",
      "NP-PN=66",
      "PP-LGS+NP-PN=66",
      "NP-PN+NP",
      "DP-TPC|<>",
      "FRAG+NP-PN",
      "IP-OBJ+NP-SBJ",
      "QP-APP",
      "PP-DIR+NP",
      "QP-APP|<>",
      "CP+CP+IP",
      "CLP+NP",
      "LST|<>",
      "IP-IMP|<>",
      "IP-IMP",
      "PP-SBJ|<>",
      "PRN+IP",
      "NP-FOC-2",
      "NP-PN+NP=4",
      "NP+ADJP",
      "CP+CP+IP+VP",
      "IP-CND|<>",
      "NP-2",
      "UCP-EXT|<>",
      "UCP-EXT",
      "PP-TPC|<>",
      "PP-TPC",
      "PP-DIR-1|<>",
      "PP-DIR-1",
      "NP-OBJ=3",
      "IP=4+VP",
      "QP-OBJ=3",
      "NP-HLN-TTL|<>",
      "NP-HLN-TTL",
      "NP-PN-SHORT",
      "NP-SBJ-3|<>",
      "NP-SBJ-4|<>",
      "DNP+QP",
      "NP-PRD-TTL|<>",
      "VP+NP-PRD-TTL",
      "QP-EXT=4|<>",
      "QP-EXT=4",
      "IP-OBJ-TTL|<>",
      "IP-OBJ-TTL",
      "IP-IMP-SBJ+VP",
      "CP-CND+IP+VP",
      "NP-PN=2|<>",
      "NP-PN=2",
      "PP-LGS+NP-PN=2",
      "NP-OBJ-WH",
      "IP-IJ|<>",
      "IP-IJ",
      "IP-ADV+VP+VPT",
      "NP-SBJ+CP",
      "DP-WH",
      "IP-IJ+VP",
      "IP-Q+VP",
      "CP-OBJ+IP-OBJ",
      "IP-TPC-2|<>",
      "IP-TPC-2",
      "VP+PP-DIR",
      "NP-ADV+CP",
      "CP-OBJ",
      "CP-OBJ|<>",
      "IP-TPC-3|<>",
      "IP-TPC-3",
      "IP-IJ-TPC-1|<>",
      "IP-IJ-TPC-1",
      "QP-WH",
      "NP-SBJ-WH",
      "NP-WH",
      "CP-TPC-1|<>",
      "CP-TPC-1",
      "IP-MNR+VP",
      "VP+IP-OBJ",
      "NP-OBJ+NP-APP",
      "NP-OBJ=5|<>",
      "NP-OBJ=5",
      "NP-EXT=5",
      "IP+VCD",
      "NP-OBJ=4",
      "IP=5+VP",
      "NP-OBJ=4|<>",
      "LCP-TMP+NP",
      "NP-EXT|<>",
      "QP-TPC",
      "NP-TMP-WH",
      "IP-APP+VP+VCD",
      "IP-TPC-4|<>",
      "IP-TPC-4",
      "QP-OBJ-WH",
      "LCP-APP|<>",
      "LCP-APP",
      "NP-OBJ+CP+IP+VP",
      "NP-FOC",
      "IP-OBJ+VP+VCD",
      "NP+DP",
      "IP+VP+PP-PRD",
      "CLP-TMP",
      "CLP-TMP|<>",
      "QP-TPC|<>",
      "CP+IP+VP+PP-PRD",
      "NP-TPC-3+CP+CP",
      "IP-ADV+IP",
      "IP-TPC-3+VP",
      "ADVP+PP",
      "VP-FOC+VCD",
      "IP=3+VP",
      "NP+CP+CP+IP+VP",
      "VP+IP+VP",
      "CP+IP+VP+VSB",
      "NP-TPC+CP+CP",
      "VP+ADJP-PRD",
      "VP+UCP-PRD",
      "PRN-PN-SBJ-TTL|<>",
      "PRN-PN-SBJ-TTL",
      "QP-OBJ-1",
      "DNP+NP",
      "PP+NP",
      "LCP+NP",
      "NP=2",
      "NP=2|<>",
      "PP-MNR+NP=2",
      "DVP+NP",
      "NP-PN=3|<>",
      "NP-PN=3",
      "NP=3|<>",
      "PP-LGS+NP=3",
      "VP+VP+VCD",
      "IP+VP+QP-PRD",
      "NP-PN-SBJ-1",
      "NP-PRD+CP+IP+VP",
      "NP-3",
      "NP-SBJ+CP+IP",
      "IP-4+VP",
      "NP-DIR",
      "ADJP-PRD",
      "VP+VNV",
      "VP-EXT+VRD",
      "CLP-EXT",
      "DP-WH|<>",
      "NP-SBJ+DNP",
      "NP-OBJ+DNP",
      "NP+CP+IP",
      "DP-PRD",
      "LCP-TPC",
      "LCP-TPC|<>",
      "NP-SBJ-TTL-1|<>",
      "NP-SBJ-TTL-1",
      "QP-TPC-2|<>",
      "QP-TPC-2",
      "CP-IMP|<>",
      "CP-IMP",
      "IP-PN",
      "IP-PN-TTL|<>",
      "IP-PN-TTL",
      "IP-OBJ-1+VP",
      "NP-PN-SBJ-4|<>",
      "NP-PN-SBJ-4",
      "PP-MNR+NP-PN",
      "ADVP-ADV",
      "CLP-LOC",
      "CLP-LOC|<>",
      "VP-EXT+PP-PRD",
      "IP-SBJ-1+VP",
      "NP-SBJ+DP",
      "NP-OBJ-TTL-1|<>",
      "NP-OBJ-TTL-1",
      "IP-SBJ-2+VP",
      "LCP-HLN",
      "LCP-HLN|<>",
      "VNV-WH|<>",
      "VNV-WH",
      "VP+VCP",
      "VP+PP",
      "NP-DIR|<>",
      "IP-TPC-6|<>",
      "IP-TPC-6",
      "IP-SBJ+VP+VCD",
      "IP-Q-TPC-1|<>",
      "IP-Q-TPC-1",
      "DP-SBJ-WH|<>",
      "DP-SBJ-WH",
      "NP-TPC+NP",
      "IP-PRD-Q|<>",
      "IP-PRD-Q",
      "ADJP-PRD|<>",
      "VP-OBJ",
      "NP-PRD-WH",
      "IP-HLN-Q|<>",
      "IP-HLN-Q",
      "IP-Q-TPC",
      "NP-Q|<>",
      "NP-Q",
      "UCP-HLN-Q|<>",
      "UCP-HLN-Q",
      "QP-PRD-WH|<>",
      "VP+QP-PRD-WH",
      "PP-HLN",
      "IP-Q-SBJ",
      "ADJP+ADJP",
      "DVP+VP+VCD",
      "VP-PRD+PP",
      "PP-DIR+PP",
      "NP-PN-SBJ+NP",
      "IP-TPC-5|<>",
      "IP-TPC-5",
      "VP-EXT+NP-PRD",
      "IP-SBJ-TTL|<>",
      "IP-SBJ-TTL",
      "VP-EXT|<>",
      "IP-Q-SBJ+VP",
      "QP-SBJ-WH",
      "NP-APP+NP-TTL",
      "IP-PRP",
      "NP-OBJ+ADJP",
      "IP-IMP+VP+VSB",
      "IP+VP+VCP",
      "VPT-WH|<>",
      "VP+VPT-WH",
      "IP+VP+VPT",
      "IP-EXT",
      "IP-EXT|<>",
      "VP+NP-PN-PRD",
      "IP-SBJ+VP+VNV",
      "PP-PRP+IP+VP",
      "QP-HLN|<>",
      "QP-HLN",
      "IP-Q-1|<>",
      "IP-Q-1",
      "IP-ADV-Q+VP",
      "IP-Q-TPC|<>",
      "VP-WH|<>",
      "NP-DIR-PN",
      "IP-Q-SBJ|<>",
      "PP-TPC-1|<>",
      "PP-TPC-1",
      "NP-PRD+CP+CP+IP",
      "NP-PRP",
      "UCP-TPC",
      "IP-APP-Q+VP",
      "IP-TMP|<>",
      "QP-TPC-5|<>",
      "QP-TPC-5",
      "IP-OBJ+VP+VSB",
      "IP-SBJ-WH|<>",
      "IP-SBJ-WH",
      "CP-TPC-3|<>",
      "CP-TPC-3",
      "DVP+VP+VCP",
      "IP-OBJ+VP+VPT",
      "IP-Q+VP-WH",
      "IP-OBJ+VP+NP-OBJ",
      "VP-2",
      "VP+VNV-WH",
      "VP+PP-PRP",
      "CP-TPC-2|<>",
      "CP-TPC-2",
      "IP-SBJ+VP+VSB",
      "NP-TPC-4",
      "DP+DP",
      "IP-SBJ+VP+VPT",
      "IP-Q+VP+NP-PRD",
      "PRN-PRD|<>",
      "PRN-PRD",
      "IP-Q-TPC+VP",
      "NP-OBJ-PN-TTL|<>",
      "NP-OBJ-PN-TTL",
      "IP-CND+VP+VPT",
      "QP-OBJ+CLP",
      "NP-OBJ+CP-APP",
      "NP-OBJ+CP+IP",
      "PP-PRP+IP",
      "NP-EXT+QP",
      "NP-OBJ+PP",
      "PP-PRD-PRP|<>",
      "PP-PRD-PRP",
      "VP+VP+VSB",
      "IP+VP+VP+VSB",
      "VP+IP-PRD",
      "VP-2|<>",
      "NP-PN-VOC",
      "CP-OBJ-Q",
      "CP-OBJ-Q|<>",
      "CP+IP-LOC",
      "IP-3+VP",
      "IP-IMP+VP+VRD",
      "NP-OBJ+VP",
      "NP-PRD-1",
      "PRN+IP+VP",
      "VP+IP-PRD-Q+VP",
      "VP+IP-Q",
      "INTJ+VP",
      "IP-PRP+VP",
      "IP-ADV+VP+VSB",
      "CP-CND-TPC-3|<>",
      "CP-CND-TPC-3",
      "NP+PP",
      "IP-OBJ+VP+PP-PRD",
      "NP-HLN-Q|<>",
      "NP-HLN-Q",
      "IP-TTL+VP",
      "VP-FOC+VSB",
      "NP-PN-SBJ-2|<>",
      "NP-PN-SBJ-2",
      "PP-TMP+NP",
      "NP-LGS",
      "NP-IO+NP",
      "NP-WH|<>",
      "IP-OBJ-WH",
      "IP-OBJ-WH+VP",
      "IP-HLN-IMP",
      "IP-HLN-IMP|<>",
      "QP-MNR|<>",
      "QP-MNR",
      "INTJ-WH",
      "DNP-OBJ",
      "DNP-OBJ|<>",
      "IP-PRD-Q+VP",
      "VP-FOC+VPT",
      "IP-1|<>",
      "IP-1",
      "INTJ-IJ",
      "NP-FOC-1",
      "DP-HLN",
      "ADVP-PRP",
      "NP-TPC-6",
      "VP-FOC+VRD",
      "IP-APP+VP+VSB",
      "IP-ADV+VP+VCD",
      "IP-HLN-TTL|<>",
      "IP-HLN-TTL",
      "CLP+CP",
      "NP-PN-WH",
      "NP-EXT-WH",
      "NP-PN-TMP",
      "LCP+IP+VP+VRD",
      "PP-SBJ-3",
      "ADJP-APP|<>",
      "ADJP-APP",
      "IP-PRP|<>",
      "CLP-5",
      "IP-TPC-8|<>",
      "IP-TPC-8",
      "NP-ADV+CP+CP",
      "CP-HLN|<>",
      "CP-HLN",
      "QP-ADV+CLP",
      "INTJ",
      "IP-SBJ+VP+VNV-WH",
      "NP-TPC-WH-1",
      "VP+PP-LOC",
      "NP-TPC-5",
      "LCP+IP",
      "PP-IO|<>",
      "PP-IO",
      "LCP-TMP+IP",
      "NP-FOC-TTL|<>",
      "NP-FOC-TTL",
      "IP-HLN+VP+PP-PRD",
      "IP-SBJ+VP+NP-PRD",
      "VP-EXT+PP",
      "QP-PRD-WH",
      "CP-PRD-Q",
      "CP-PRD-Q|<>",
      "CLP-SBJ",
      "CLP-SBJ|<>",
      "IP-PRP+VP+NP-PRD",
      "IP-HLN-WH",
      "IP-HLN-WH|<>",
      "NP-APP+CP+CP",
      "CP-PRP+IP+VP",
      "CP+IP+VP+VRD",
      "CP+IP+VP+NP-PRD",
      "IP-EXT+VP",
      "NP-IJ-OBJ|<>",
      "NP-IJ-OBJ",
      "NP-SBJ+CP+IP+VP+VRD",
      "NP-Q-SBJ|<>",
      "NP-Q-SBJ",
      "VP+IP-PRD+VP",
      "IP-SBJ-WH+VP",
      "NP-SBJ+CP+CP+IP",
      "NP+QP",
      "DP-IO|<>",
      "DP-IO",
      "NP-PRD+DNP",
      "NP+CP",
      "PP-HLN|<>",
      "UCP-TPC|<>",
      "NP-OBJ-WH|<>",
      "NP-TPC+DNP",
      "ADVP-IJ",
      "IP-OBJ-4",
      "LCP-DIR",
      "LCP-DIR|<>",
      "IP-Q-TPC-2|<>",
      "IP-Q-TPC-2",
      "IP-TTL+VP+VCD",
      "NP-DIR-WH",
      "VP-EXT+VCD",
      "CP+CP+IP+VP+VP",
      "IP-ADV+VP+PP-PRD",
      "NP-OBJ+CP+CP+IP+VP",
      "VP-EXT+QP-PRD-WH",
      "NP-PN-SBJ+VP",
      "IP-PRD+VP+VCD",
      "UCP+LCP",
      "IP+VP+QP-PRD+QP",
      "NP-IJ+NP-SBJ",
      "IP-TPC-1+VP",
      "VP-LOC",
      "QP-WH|<>",
      "VP+VP+VPT",
      "PRN+NP-PN",
      "NP-PRD-TTL",
      "QP-SBJ+QP",
      "NP-TMP+NP",
      "LCP-HLN+LCP",
      "PP-APP|<>",
      "PP-APP",
      "QP+NP",
      "PP-ADV-SBJ|<>",
      "PP-ADV-SBJ",
      "LCP-LOC+LCP",
      "PRN+PP",
      "NP-SBJ+IP+VP",
      "NP+CP+IP+VP",
      "PP-DIR-HLN",
      "PRN+DNP",
      "DNP-SBJ",
      "DNP-SBJ|<>",
      "UCP+IP",
      "PRN+QP",
      "NP-LGS|<>",
      "CP-HLN-Q|<>",
      "CP-HLN-Q",
      "CP-Q-TPC-1",
      "CP-Q-TPC-1|<>",
      "IP-ADV-Q|<>",
      "IP-ADV-Q",
      "NP-IJ|<>",
      "VP-APP+ADJP",
      "DNP-TPC",
      "DNP-TPC|<>",
      "NP-OBJ-Q|<>",
      "NP-OBJ-Q",
      "VP+LCP-OBJ",
      "IP-PRD-1|<>",
      "IP-PRD-1",
      "IP-OBJ-PN|<>",
      "IP-OBJ-PN",
      "LCP-EXT+LCP",
      "VP-OBJ|<>",
      "NP-PRP|<>",
      "PP-OBJ|<>",
      "PP-OBJ",
      "IP-HLN+NP",
      "ADVP-Q",
      "QP-TTL|<>",
      "QP-TTL",
      "QP+QP",
      "VP+NP",
      "IP-DIR+VP",
      "UCP-LOC|<>",
      "UCP-LOC",
      "IP+VP-OBJ",
      "FLR+VP",
      "VP+PP-TMP",
      "VP+PP-MNR",
      "IP+NP",
      "IP-TPC-2+VP",
      "IP+QP+VP",
      "NP-SBJ+QP",
      "QP-DIR|<>",
      "QP-DIR",
      "FLR",
      "NP+NP-APP",
      "NP-LGS-PN",
      "NP-CLR",
      "VP+PP-LGS",
      "IP-OBJ+IP-SBJ",
      "DNP+PP",
      "NP-SBJ-5",
      "CP-ADV+CP",
      "IP-LOC|<>",
      "IP-LOC",
      "NP-SBJ-9",
      "IP+PP-DIR",
      "FLR+IP",
      "FLR+NP",
      "FLR+PP",
      "FLR+DP",
      "IP-SBJ+IP",
      "NP-OBJ+CP",
      "QP-SBJ-2",
      "IP-MNR",
      "NP-FOC-3+CP+CP",
      "CP+IP+VP+VP+VCD",
      "NP+LCP",
      "IP-NOM|<>",
      "IP-NOM",
      "NP-SBJ+ADVP",
      "NP-FOC-4",
      "NP-FOC-3",
      "NP-TPC-4|<>",
      "LCP-MNR",
      "LCP-MNR|<>",
      "NP-ADV+QP",
      "IP-NOM+VP",
      "NP-PN-VOC|<>",
      "NP-SBJ+CLP",
      "NP-DIR-PN|<>",
      "NP-APP-LOC|<>",
      "NP-APP-LOC",
      "IP+PP-TMP",
      "CP+IP+VP+VP+VSB",
      "IP+PP-LOC",
      "PRN+CP",
      "VP-NOM",
      "IP-OBJ+VP+VNV",
      "IP-Q+VP+VNV",
      "FLR|<>",
      "IP-MNR+NP-SBJ+VP",
      "LCP-1",
      "LCP-1|<>",
      "IP-IO",
      "CP-APP+VP",
      "QP-LOC",
      "NP-BNF",
      "VP+CP-PRD",
      "CP-OBJ+CP",
      "NP-CND+CP+CP",
      "VP+NP-TMP",
      "NP-FOC+CP+CP",
      "FLR+NP+CP+CP",
      "IP-MNR+VP+VRD",
      "IP-TPC+VP+VPT",
      "IP-IO|<>",
      "CP-IO|<>",
      "CP-IO",
      "DNP-PN",
      "DNP-PN|<>",
      "NP-SBJ-6|<>",
      "NP-SBJ-6",
      "VP-NOM-SBJ",
      "CP-OBJ-1",
      "CP-OBJ-1|<>",
      "PRN+NP+QP",
      "IP-OBJ-2+VP",
      "NP-PRD-4|<>",
      "NP-PRD-4",
      "NP-OBJ+PRN+IP",
      "IP+VP+VNV",
      "IP-OBJ+NP",
      "ADJP+NP",
      "VP-PRD+QP",
      "VP-EXT+VPT",
      "VP+VP+VRD",
      "VP-PRD+LCP",
      "NP+CP+CP+IP",
      "PRN+CP-ADV",
      "DP-LOC|<>",
      "DP-LOC",
      "NP+IP+IP+VP",
      "QP-ADV+PP",
      "TOP|<>",
      "NP-SBJ+LCP",
      "NP-TPC+CP",
      "NP-EXT-2",
      "IP-OBJ-1",
      "VP+QP-PRD+QP",
      "NP-SBJ-7",
      "CP-EXT",
      "CP-EXT|<>",
      "NP-OBJ+DP",
      "IP-TMP+VP+VCD",
      "IP-TPC+VP+VNV",
      "NP-SBJ-2+CP+IP+VP",
      "QP-TPC-1",
      "NP-SBJ-5|<>",
      "NP-PN-SBJ-6",
      "CP-TMP",
      "CP-TMP|<>",
      "NP-IMP",
      "NP-FOC-4|<>",
      "IP-OBJ+VP-WH",
      "NP-ADV+DNP",
      "LCP-OBJ+LCP",
      "CP+CP+IP+VP+VCD",
      "IP+IP+VP",
      "LCP-TMP+QP",
      "NP-EXT+CP+IP+VP",
      "LST+QP",
      "PRN+PP-ADV",
      "CP-OBJ-2",
      "CP-OBJ-2|<>",
      "NP-PRP+CP+CP",
      "DNP+ADJP",
      "VP-NOM|<>",
      "IP-NOM-PRD|<>",
      "IP-NOM-PRD",
      "IP-IMP-OBJ|<>",
      "IP-IMP-OBJ",
      "VP-LOC|<>",
      "IP-DIR",
      "IP+CP",
      "NP-ADV-PN|<>",
      "NP-ADV-PN",
      "VP-PN|<>",
      "VP-PN",
      "DNP-DIR",
      "DNP-DIR|<>",
      "VP+PP-ADV",
      "IP-NOM-PN|<>",
      "IP-NOM-PN",
      "IP+NP-SBJ",
      "VP-1",
      "IP-OBJ+CP-ADV",
      "IP-OBJ+QP+VP",
      "IP-SBJ+VP+VP",
      "DP-PN",
      "IP-OBJ+PP-PRP",
      "NP-SBJ-8|<>",
      "NP-SBJ-8",
      "IP-PN+VP",
      "IP+VP+PP",
      "CP-CND+CP",
      "NP-PN-TPC-2",
      "IP-SBJ-1",
      "NP-TMP+DNP",
      "NP-OBJ-PN-1|<>",
      "IP-SBJ-3+VP",
      "NP-PN+VP",
      "IP+VP-SBJ",
      "NP-OBJ-PN-2",
      "NP-OBJ-PN-4",
      "IP-5+VP",
      "NP-OBJ-PN=8",
      "IP=9+VP",
      "NP-LOC+NP",
      "UCP-HLN|<>",
      "UCP-HLN",
      "VP-4|<>",
      "VP-4",
      "IP-OBJ+VP+PP",
      "NP-PN=1",
      "PP+NP-PN=1",
      "PP-LOC=4|<>",
      "PP-LOC=4",
      "LST-SBJ",
      "PP-MNR+IP+VP",
      "VP+NP-OBJ=4",
      "VP-EXT+VNV",
      "PP-LOC-2|<>",
      "PP-LOC-2",
      "IP+VP+NP-OBJ",
      "IP-APP+VP+VRD",
      "NP-VOC+DNP",
      "LCP-OBJ-2",
      "LCP-OBJ-2|<>",
      "NP-VOC+CP+CP",
      "QP-PN-SBJ",
      "NP-PN-SBJ-3",
      "IP-IMP-PRD|<>",
      "IP-IMP-PRD",
      "DVP-ADV",
      "DVP-ADV|<>",
      "IP-OBJ-WH|<>",
      "DVP+VP+PP-PRD",
      "IP+VP+VP+PP-PRD",
      "UCP-OBJ-TTL|<>",
      "UCP-OBJ-TTL",
      "UCP-TTL|<>",
      "UCP-TTL",
      "FLR+ADVP",
      "NP-TMP+DP",
      "IP-PRD+IP-ADV",
      "DNP+DP",
      "IP+NP-VOC",
      "IP+LCP",
      "NP-SBJ-4+CP+IP+VP",
      "CP-SBJ",
      "IP-MNR|<>",
      "NP-SBJ-3+DNP",
      "NP-SBJ-9|<>",
      "DNP+LCP",
      "VP+DVP",
      "VP+PP-BNF",
      "NP-SBJ-1+NP",
      "NP-PN-SBJ-1|<>",
      "QP-SBJ+NP",
      "IP-ADV+NP",
      "WHPP",
      "DFL|<>",
      "DFL",
      "DFL+NP",
      "ADVP+ADVP",
      "ADJP-WH",
      "INC+IP-OBJ",
      "INC|<>",
      "IP+INC",
      "IP+VP+PP-PRP",
      "QP-VOC|<>",
      "QP-VOC",
      "IP-TMP+VP+VRD",
      "INC+NP",
      "INC",
      "INC+CP-CND",
      "INC+CP-ADV",
      "DP-TPC-1|<>",
      "DP-TPC-1",
      "NP-PRD-WH|<>",
      "INTJ|<>",
      "UCP-Q|<>",
      "UCP-Q",
      "ADVP-EXT",
      "NP-OBJ-PN-SBJ",
      "IP+VP+DP-PRD",
      "LCP-SBJ+NP",
      "PRN+UCP",
      "PRN+DP",
      "FRAG+PP",
      "IP-NOM+VP+VRD",
      "NP-PRD+NP-PN",
      "NP-FOC-PN",
      "PP-CLR|<>",
      "PP-CLR",
      "VP-SBJ|<>",
      "NP-FOC-1|<>",
      "NP+DNP+NP",
      "NP-ADV-WH",
      "IP-PRD+IP",
      "ADVP-ADV-WH",
      "VP-PRD+VP",
      "QP-SBJ+CLP",
      "CP-NOM",
      "CP-NOM|<>",
      "QP-PN-TPC",
      "IP-PRD-1+VP",
      "PRN+LCP",
      "INTJ+NP-PN-VOC",
      "QP-EXT-WH|<>",
      "QP-EXT-WH",
      "QP-IO|<>",
      "QP-IO",
      "SKIP",
      "NP-IO-OBJ|<>",
      "NP-IO-OBJ",
      "NP-FOC-WH-1",
      "QP-SBJ-3",
      "TYPO",
      "OTH+NP",
      "ADVP-EXT-WH",
      "NP-OBJ-TMP|<>",
      "NP-OBJ-TMP",
      "NP-FOC-1+DNP",
      "IP-SBJ+VP+NP-PN-PRD",
      "IP-OBJ+VP+PP-DIR",
      "NP-TPC-2+CP+CP",
      "PP-LOC-WH|<>",
      "PP-LOC-WH",
      "NP-SBJ-VOC",
      "IP-OBJ-TTL+VP",
      "QP+LCP",
      "INC+IP-CND",
      "DP-SBJ-1|<>",
      "DP-SBJ-1",
      "IP-UNF+VP",
      "CP-APP-Q",
      "CP-APP-Q|<>",
      "IP-UNF+PP-PRP",
      "VP-UNF+PP-MNR",
      "IP-UNF+IP-APP",
      "IP-OBJ-SBJ+VP",
      "LCP-LOC-TTL",
      "LCP-LOC-TTL|<>",
      "CP-TPC-WH-1",
      "CP-TPC-WH-1|<>",
      "VP-UNF+PP-PRP",
      "VP-UNF",
      "IP-UNF+NP-SBJ",
      "IP-UNF+IP-ADV+VP",
      "QP-TPC-1|<>",
      "NP-TPC-5|<>",
      "NP-APP-PN-SBJ|<>",
      "NP-APP-PN-SBJ",
      "PP-MNR-WH|<>",
      "PP-MNR-WH",
      "VP-UNF+PP",
      "IP-IJ-IMP|<>",
      "IP-IJ-IMP",
      "CP-OBJ+NP-SBJ+NP",
      "TYPO|<>",
      "NP+TYPO",
      "DFL+DNP",
      "DFL+VNV",
      "PP+IP",
      "INC+IP",
      "NP-IJ-Q|<>",
      "NP-IJ-Q",
      "IP-IJ-Q",
      "IP-IJ-Q|<>",
      "NP-TPC-7",
      "IP-ADV+VP-UNF",
      "IP-PRD+VP+VPT",
      "PP-PN|<>",
      "PP-PN",
      "IP-ADV+VP+VP",
      "IP-NOM-OBJ",
      "IP-PRD+VP+VRD",
      "VP+QP-PRD+CLP",
      "UCP-APP-PN|<>",
      "UCP-APP-PN",
      "VP+NP-PRD-WH",
      "NP-Q-TMP",
      "NP-Q-TMP|<>",
      "NP-VOC+NP",
      "NP-Q-VOC|<>",
      "NP-Q-VOC",
      "NP-PN-Q|<>",
      "NP-PN-Q",
      "EMO",
      "NP-OBJ-WH+DNP",
      "NP-PN-SBJ-VOC",
      "UCP-IMP|<>",
      "UCP-IMP",
      "SKIP|<>",
      "EMO|<>",
      "QP-OBJ-WH|<>",
      "IP+VP+NP-PRD-WH",
      "OTH+DNP",
      "DNP-WH",
      "DNP-WH|<>",
      "INC+PP-PRP",
      "IMG|<>",
      "IMG",
      "INC+ADVP",
      "NP-TMP+QP",
      "QP-TMP-WH|<>",
      "QP-TMP-WH",
      "INC+QP",
      "VP+NP-PRD-WH+DNP",
      "VP+NP-PRD+DNP",
      "INTJ-Q|<>",
      "INTJ-Q",
      "NP-Q+IP",
      "VP-EXT-WH",
      "INC+NP-PN",
      "NP-CND",
      "NP-OBJ+DNP+NP",
      "INTJ+FLR",
      "DP-PRD-WH|<>",
      "IP+VP+DP-PRD-WH",
      "IP+VP+NP-PRD+CP+CP",
      "INC+NP-VOC",
      "INC+DNP",
      "INC+NP-TMP",
      "OTH",
      "VP-WH+VP",
      "NP-TMP-WH|<>",
      "INC+PP-TMP",
      "QP-EXT+CLP",
      "NP-PN+QP",
      "IP-ADV+VP+VNV",
      "VP-UNF+ADVP",
      "NP-PRD-WH+DNP",
      "INC+NP-Q",
      "INC+PP-LOC",
      "IP-CND+VP+VRD",
      "IP-ADV+VP+NP",
      "DP-Q|<>",
      "DP-Q",
      "LCP+NP-PN",
      "NP-DIS",
      "PP-LOC-Q-WH|<>",
      "PP-LOC-Q-WH",
      "PP-DIR-WH|<>",
      "PP-DIR-WH",
      "IP-OBJ-SBJ",
      "INC+VP",
      "VP-UNF+NP",
      "NP-WH+DNP",
      "UCP-OBJ-Q|<>",
      "UCP-OBJ-Q",
      "VP-TMP|<>",
      "VP-TMP",
      "NP-TPC-1+NP",
      "NP+LST",
      "INC+PP-ADV",
      "NP-SBJ-1+DNP",
      "PP-PRD-WH|<>",
      "PP-PRD-WH",
      "NP-SBJ-2+CP+CP",
      "IP-OBJ+VP+NP-PRD+CP+CP",
      "NP-PN-TPC-1|<>",
      "DNP-Q|<>",
      "DNP-Q",
      "DP-DIR",
      "IP+VP+NP-PRD+DNP",
      "NP-FOC|<>",
      "VP+NP-PN",
      "IP-SBJ+VP-WH",
      "QP-FOC-1",
      "NP-LOC-WH",
      "QP-Q",
      "PP-ADV-Q|<>",
      "PP-ADV-Q",
      "IP-ADV+CP",
      "QP-FOC-1|<>",
      "VP+NP-PRD+QP",
      "VP-OBJ-PN|<>",
      "VP-OBJ-PN",
      "IP-OBJ+VP+NP-PRD",
      "NP-TPC-2+DNP",
      "IP+VP+NP-PN-PRD",
      "ADVP-EXT-1",
      "NP-OBJ-VOC",
      "DP-PRP|<>",
      "DP-PRP",
      "CP-SBJ|<>",
      "NP-TPC-WH-1|<>",
      "VP-UNF|<>",
      "DFL+VP",
      "DFL+IP",
      "VP-UNF+VRD",
      "DFL+QP",
      "DFL+CP",
      "NP-UNF|<>",
      "NP-UNF",
      "NP-UNF+QP+CLP",
      "NP-UNF+FLR",
      "IP-OBJ+VP-UNF",
      "INC+PP",
      "VP-SBJ",
      "ADVP-EXT|<>",
      "NP-SBJ-WH|<>",
      "DFL+ADVP",
      "VP-UNF+PP-BNF",
      "DFL+VP+VRD",
      "INC+VP-UNF",
      "IP-UNF+LCP-TMP",
      "QP-UNF",
      "DFL+PP-ADV",
      "IP-UNF|<>",
      "IP-UNF"
    ],
    "pad_token": null,
    "unk_token": "NP-PN|<>",
    "mutable": false,
    "type": "hanlp.common.vocab.VocabWithNone"
  }
}